[
  {
    "plantId": 1,
    "plantName": "Snake Plant",
    "category": "Air Purifier",
    "price": 18,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Easy",
    "description": "The Snake Plant, also known as Sansevieria or Mother-in-Law’s Tongue, is a hardy, low-maintenance indoor plant prized for its upright, sword-shaped leaves with striking green patterns. It thrives in both low and bright indirect light, making it perfect for homes and offices. This plant purifies the air by removing toxins like formaldehyde and benzene, improving indoor air quality. Snake Plants require minimal watering—typically every 2–3 weeks—allowing the soil to dry completely between waterings. They tolerate neglect and adapt well to various environments, making them ideal for beginners. Fertilize lightly during spring and summer for healthy growth and vibrant foliage.",
    "image": "https://www.gardenia.net/wp-content/uploads/2020/01/shutterstock_653738242.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 2,
    "plantName": "Fiddle Leaf Fig",
    "category": "Decorative",
    "price": 35,
    "rating": 4.5,
    "availableStock": 7,
    "careLevel": "Medium",
    "description": "The Fiddle Leaf Fig (Ficus lyrata) is a popular indoor plant known for its large, glossy, violin-shaped leaves that add a bold tropical touch to any space. It thrives in bright, indirect sunlight and prefers consistent moisture without being waterlogged. Overwatering can cause root rot, so well-draining soil is essential. The plant benefits from monthly feeding during the growing season with a balanced fertilizer. It enjoys a warm, humid environment and should be kept away from cold drafts. Regular leaf cleaning helps it photosynthesize efficiently, and occasional pruning maintains its shape and encourages healthy, upward growth.",
    "image": "https://gardenerspath.com/wp-content/uploads/2021/01/Fiddle-Leaf-Figs-in-Small-Containers.jpg",
    "providerName": "GreenLeaf Co."
  },
  {
    "plantId": 3,
    "plantName": "Monstera Deliciosa",
    "category": "Decorative",
    "price": 30,
    "rating": 4.7,
    "availableStock": 5,
    "careLevel": "Medium",
    "description": "Monstera Deliciosa, also known as the Swiss Cheese Plant, is a popular tropical houseplant native to Central America. It features large, glossy, heart-shaped leaves with distinctive splits and holes that develop as the plant matures. Thriving in bright, indirect light and high humidity, it prefers well-draining soil and moderate watering—allowing the top inch of soil to dry between waterings. Monstera grows rapidly, often requiring support like a moss pole. It can purify indoor air and add a lush, jungle-like aesthetic to interiors. With proper care, this hardy plant can live for many years and grow impressively large indoors.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSvWSplvkYNyLfDzkDMp6U2kRYJDhALmT72QQ&s",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 4,
    "plantName": "Peace Lily",
    "category": "Air Purifier",
    "price": 22,
    "rating": 4.6,
    "availableStock": 8,
    "careLevel": "Easy",
    "description": "The Peace Lily (Spathiphyllum) is a popular indoor plant known for its elegant white blooms and lush green leaves. It thrives in low to medium indirect light, making it ideal for homes and offices. The plant prefers consistently moist soil but should not be overwatered. Peace Lilies help purify indoor air by removing toxins like benzene and formaldehyde. They enjoy warm, humid environments and occasional misting. Fertilize every 6–8 weeks during spring and summer for healthy growth. Keep them away from direct sunlight to prevent leaf burn. Though beautiful, their leaves and flowers are mildly toxic to pets and humans.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ57RMhNi8XiSVeGTqtXVJB-giWAd5Yg2Ixcg&s",
    "providerName": "GreenLeaf Co."
  },
  {
    "plantId": 5,
    "plantName": "Aloe Vera",
    "category": "Medicinal",
    "price": 12,
    "rating": 4.9,
    "availableStock": 15,
    "careLevel": "Easy",
    "description": "Aloe Vera is a succulent plant known for its thick, fleshy leaves filled with soothing gel. It thrives in bright, indirect sunlight and requires minimal watering, making it an ideal indoor plant. The gel inside its leaves is rich in vitamins, minerals, and antioxidants, often used for skincare, burns, and wound healing. Aloe Vera also improves air quality by removing toxins and releasing oxygen at night. It grows best in well-draining soil and warm temperatures. With proper care, Aloe Vera can live for years, offering both beauty and natural health benefits in homes and gardens.",
    "image": "https://gardenerspath.com/wp-content/uploads/2021/01/Aloe-Vera-Plants-Growing-in-the-Garden.jpg",
    "providerName": "SucculentWorld"
  },
  {
    "plantId": 6,
    "plantName": "Spider Plant",
    "category": "Air Purifier",
    "price": 15,
    "rating": 4.4,
    "availableStock": 12,
    "careLevel": "Easy",
    "description": "The Spider Plant (Chlorophytum comosum) is a popular indoor plant known for its long, arching green leaves with white or yellow stripes. It thrives in bright, indirect light but can tolerate low light conditions. Water the plant moderately, allowing the soil to dry out between waterings. Overwatering can cause root rot. Spider Plants are excellent air purifiers, removing toxins like formaldehyde and xylene from the air. They grow quickly and produce small white flowers and baby plantlets, which can be easily propagated. This low-maintenance plant is ideal for beginners and adds a fresh, natural touch to any indoor space.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRnBXeR9_v0wpzBOrCv8MkodZ6woo53aVnllg&s",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 7,
    "plantName": "Rubber Plant",
    "category": "Decorative",
    "price": 28,
    "rating": 4.5,
    "availableStock": 6,
    "careLevel": "Medium",
    "description": "The Rubber Plant (Ficus elastica) is a popular indoor plant known for its large, glossy leaves and air-purifying qualities. It thrives in bright, indirect light but can tolerate low light conditions. Water moderately, allowing the top inch of soil to dry between waterings to prevent root rot. This plant enjoys warm, humid environments and occasional leaf wiping to remove dust. Fertilize monthly during the growing season for healthy growth. With proper care, the Rubber Plant can grow tall and become a stunning indoor centerpiece, adding both beauty and freshness to your living space.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQDhWerWMHRO6ti67aYqCFXClAbLv87ZBsJ8Q&s",
    "providerName": "GreenLeaf Co."
  },
  {
    "plantId": 8,
    "plantName": "Lavender",
    "category": "Aromatic",
    "price": 20,
    "rating": 4.8,
    "availableStock": 10,
    "careLevel": "Medium",
    "description": "Lavender is a fragrant flowering plant known for its calming aroma and vibrant purple blooms. It thrives in full sunlight and well-drained soil, making it ideal for gardens and pots. Native to the Mediterranean region, lavender is widely used in aromatherapy, skincare, and herbal remedies for its soothing properties. Its essential oil helps reduce stress, improve sleep, and repel insects. The plant requires moderate watering, allowing the soil to dry between sessions. Lavender blooms in late spring to early summer and attracts pollinators like bees and butterflies, adding both beauty and ecological value to any landscape or indoor space",
    "image": "https://media.istockphoto.com/id/1205826202/photo/blooming-lavender-flowers-detail.jpg?s=612x612&w=0&k=20&c=KeOro2RWqVEWF0jo0oC38M2eZsZwhwTRDezl17tfySM=",
    "providerName": "Herbal Gardens"
  },
  {
    "plantId": 9,
    "plantName": "Boston Fern",
    "category": "Decorative",
    "price": 25,
    "rating": 4.3,
    "availableStock": 9,
    "careLevel": "Hard",
    "description": "Boston Fern, scientifically known as Nephrolepis exaltata, is a popular indoor and outdoor plant valued for its lush, arching fronds. It thrives in bright, indirect light but can tolerate partial shade. This fern prefers consistently moist, well-draining soil and high humidity, making it ideal for bathrooms or terrariums. Fertilize monthly during the growing season with a balanced liquid fertilizer. Boston Fern helps purify indoor air by removing toxins. Regular pruning of dead fronds encourages new growth. It is sensitive to drafts and sudden temperature changes, thriving best in temperatures between 60–75°F (15–24°C). Low maintenance and visually appealing.",
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSckkFEStezT0GDHQQ-3PV5rB8wP9tM5xhrVA&s",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 10,
    "plantName": "Jade Plant",
    "category": "Succulent",
    "price": 18,
    "rating": 4.6,
    "availableStock": 11,
    "careLevel": "Easy",
    "description": "The Jade Plant, also known as Crassula ovata, is a popular succulent native to South Africa and Mozambique. It has thick, fleshy, oval-shaped green leaves that store water, making it drought-tolerant. This low-maintenance plant thrives in bright, indirect sunlight but can tolerate some direct light. It prefers well-draining soil and should be watered sparingly, allowing the soil to dry between waterings. Jade Plants can grow into small shrubs with age and may produce small white or pink star-shaped flowers in winter. They are often considered symbols of luck, prosperity, and friendship and are commonly kept as indoor ornamental plants.",
    "image": "https://media.istockphoto.com/id/1371375030/photo/crassula-ovata-known-as-lucky-plant-or-money-tree-in-a-white-pot-in-front-of-a-window-on-a.jpg?s=612x612&w=0&k=20&c=FjLmGzSiYMEv7Zu-43PZaU0Rgl3LasF_xajadKr9YP8=",
    "providerName": "SucculentWorld"
  },
  {
    "plantId": 11,
    "plantName": "Pothos",
    "category": "Air Purifier",
    "price": 16,
    "rating": 4.7,
    "availableStock": 14,
    "careLevel": "Easy",
    "description": "Pothos, also known as Devil’s Ivy, is a popular indoor vine valued for its hardiness and attractive heart-shaped leaves. It thrives in low to bright indirect light and tolerates occasional neglect, making it ideal for beginners. The plant prefers well-draining soil and should be watered when the top inch of soil feels dry. Pothos can purify indoor air by removing toxins like formaldehyde and benzene. It grows quickly and can be trained to climb or trail from shelves and hanging baskets. Fertilize monthly during the growing season and prune to maintain shape. Resistant to pests and low maintenance.",
    "image": "https://gardenerspath.com/wp-content/uploads/2022/03/How-to-Propagate-Pothos-Feature.jpg",
    "providerName": "UrbanGreen Studio"
  },
  {
    "plantId": 12,
    "plantName": "ZZ Plant",
    "category": "Low Light",
    "price": 20,
    "rating": 4.8,
    "availableStock": 9,
    "careLevel": "Easy",
    "description": "The ZZ Plant, or Zamioculcas zamiifolia, is a hardy indoor plant known for its glossy, dark green leaves and low-maintenance care. It thrives in low to bright indirect light and can tolerate occasional neglect, making it ideal for beginners. Water sparingly, allowing the soil to dry completely between waterings, as overwatering can cause root rot. ZZ Plants prefer well-draining soil and occasional fertilization during the growing season. They are drought-tolerant, air-purifying, and can survive in offices or homes with minimal natural light. Slow-growing but visually striking, the ZZ Plant adds elegance and greenery effortlessly to any space.",
    "image": "https://jomostudio.com/cdn/shop/articles/ZZ_Plant_Varieties_ec47a908-9c57-42f0-bf0b-435281319826.jpg?v=1742583641&width=2048",
    "providerName": "GreenLeaf Co."
  }
]
